In [1]:
#BIG DATA PROCESS AND PANDAS ABILITY TRAINING

In [2]:
#import package
import pandas as pd 
import numpy as np

In [3]:
#load dataset 
import seaborn as sb
df = sb.load_dataset('titanic')
df.sample(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
809,1,1,female,33.0,1,0,53.1000,S,First,woman,False,E,Southampton,yes,False
721,0,3,male,17.0,1,0,7.0542,S,Third,man,True,NaN,Southampton,no,False
79,1,3,female,30.0,0,0,12.4750,S,Third,woman,False,NaN,Southampton,yes,True
351,0,1,male,NaN,0,0,35.0000,S,First,man,True,C,Southampton,no,True
754,1,2,female,48.0,1,2,65.0000,S,Second,woman,False,NaN,Southampton,yes,False

In [4]:
df.to_csv('titanic.csv')

In [5]:
data = pd.read_csv('titanic.csv')
data.shape

(891, 16)

In [6]:
print('头部5条数据\n',data.head(5))
print('尾部5条数据\n',data.tail(5))

头部5条数据
    Unnamed: 0  survived  pclass     sex   age  sibsp  parch     fare embarked  \
0           0         0       3    male  22.0      1      0   7.2500        S
1           1         1       1  female  38.0      1      0  71.2833        C
2           2         1       3  female  26.0      0      0   7.9250        S
3           3         1       1  female  35.0      1      0  53.1000        S
4           4         0       3    male  35.0      0      0   8.0500        S

   class    who  adult_male deck  embark_town alive  alone
0  Third    man        True  NaN  Southampton    no  False
1  First  woman       False    C    Cherbourg   yes  False
2  Third  woman       False  NaN  Southampton   yes   True
3  First  woman       False    C  Southampton   yes  False
4  Third    man        True  NaN  Southampton    no   True
尾部5条数据
      Unnamed: 0  survived  pclass     sex   age  sibsp  parch   fare embarked  \
886         886         0       2    male  27.0      0      0  13.00        S
887         887         1       1  female  19.0      0      0  30.00        S
888         888         0       3  female   NaN      1      2  23.45        S
889         889         1       1    male  26.0      0      0  30.00        C
890         890         0       3    male  32.0      0      0   7.75        Q

      class    who  adult_male deck  embark_town alive  alone
886  Second    man        True  NaN  Southampton    no   True
887   First  woman       False    B  Southampton   yes   True
888   Third  woman       False  NaN  Southampton    no  False
889   First    man        True    C    Cherbourg   yes   True
890   Third    man        True  NaN   Queenstown    no   True

In [7]:
print('将缺失值取代为0')
data_1 = data.fillna(0)
data_1.head(5)

将缺失值取代为0

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,0,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,0,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,0,Southampton,no,True

In [8]:
print('All featrues names\n',data.columns)
print('ALL matrix values\n', data.values)
print('ALL row names\n', data.index)

All featrues names
 Index(['Unnamed: 0', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
ALL matrix values
 [[0 0 3 ... 'Southampton' 'no' False]
 [1 1 1 ... 'Cherbourg' 'yes' False]
 [2 1 3 ... 'Southampton' 'yes' True]
 ...
 [888 0 3 ... 'Southampton' 'no' False]
 [889 1 1 ... 'Cherbourg' 'yes' True]
 [890 0 3 ... 'Queenstown' 'no' True]]
ALL row names
 RangeIndex(start=0, stop=891, step=1)

In [9]:
data.dtypes

Unnamed: 0       int64
survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [10]:
print('选取其中某一部分的数组')
print('选取某特定一列')
print(data['age'])
print('选取第n列')
print(data[data.columns[2]])

选取其中某一部分的数组
选取某特定一列
0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64
选取第n列
0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

In [11]:
print('根据行列位置取数据')
print('假设我们选取第3行的某两个参数')
print(data.loc[[3], ['sex', 'class']])

根据行列位置取数据
假设我们选取第3行的某两个参数
      sex  class
3  female  First

In [12]:
print('按照特定的行和列进行')
print('x-y行,m-n列\n', data.iloc[0:5, 0:4])

按照特定的行和列进行
x-y行,m-n列
    Unnamed: 0  survived  pclass     sex
0           0         0       3    male
1           1         1       1  female
2           2         1       3  female
3           3         1       1  female
4           4         0       3    male

In [13]:
print('使用位置选择某些个特定行和特定列')
print('选择a,b,c行以及x,y,z列\n', data.iloc[[1,3,5], [2,5,6]])

使用位置选择某些个特定行和特定列
选择a,b,c行以及x,y,z列
    pclass  sibsp  parch
1       1      1      0
3       1      1      0
5       3      0      0

In [14]:
print('条件筛选某一列的数据')
data_select = data[data.fare > 5]
print(data_select)
print('筛选符合条件的数据\n', data[data['alive'].isin(['yes'])])#选择的是这一列中包含某些特定参数的额

条件筛选某一列的数据
     Unnamed: 0  survived  pclass     sex   age  sibsp  parch     fare  \
0             0         0       3    male  22.0      1      0   7.2500
1             1         1       1  female  38.0      1      0  71.2833
2             2         1       3  female  26.0      0      0   7.9250
3             3         1       1  female  35.0      1      0  53.1000
4             4         0       3    male  35.0      0      0   8.0500
..          ...       ...     ...     ...   ...    ...    ...      ...
886         886         0       2    male  27.0      0      0  13.0000
887         887         1       1  female  19.0      0      0  30.0000
888         888         0       3  female   NaN      1      2  23.4500
889         889         1       1    male  26.0      0      0  30.0000
890         890         0       3    male  32.0      0      0   7.7500

    embarked   class    who  adult_male deck  embark_town alive  alone
0          S   Third    man        True  NaN  Southampton    no  False
1          C   First  woman       False    C    Cherbourg   yes  False
2          S   Third  woman       False  NaN  Southampton   yes   True
3          S   First  woman       False    C  Southampton   yes  False
4          S   Third    man        True  NaN  Southampton    no   True
..       ...     ...    ...         ...  ...          ...   ...    ...
886        S  Second    man        True  NaN  Southampton    no   True
887        S   First  woman       False    B  Southampton   yes   True
888        S   Third  woman       False  NaN  Southampton    no  False
889        C   First    man        True    C    Cherbourg   yes   True
890        Q   Third    man        True  NaN   Queenstown    no   True

[874 rows x 16 columns]
筛选符合条件的数据
      Unnamed: 0  survived  pclass     sex   age  sibsp  parch     fare  \
1             1         1       1  female  38.0      1      0  71.2833
2             2         1       3  female  26.0      0      0   7.9250
3             3         1       1  female  35.0      1      0  53.1000
8             8         1       3  female  27.0      0      2  11.1333
9             9         1       2  female  14.0      1      0  30.0708
..          ...       ...     ...     ...   ...    ...    ...      ...
875         875         1       3  female  15.0      0      0   7.2250
879         879         1       1  female  56.0      0      1  83.1583
880         880         1       2  female  25.0      0      1  26.0000
887         887         1       1  female  19.0      0      0  30.0000
889         889         1       1    male  26.0      0      0  30.0000

    embarked   class    who  adult_male deck  embark_town alive  alone
1          C   First  woman       False    C    Cherbourg   yes  False
2          S   Third  woman       False  NaN  Southampton   yes   True
3          S   First  woman       False    C  Southampton   yes  False
8          S   Third  woman       False  NaN  Southampton   yes  False
9          C  Second  child       False  NaN    Cherbourg   yes  False
..       ...     ...    ...         ...  ...          ...   ...    ...
875        C   Third  child       False  NaN    Cherbourg   yes   True
879        C   First  woman       False    C    Cherbourg   yes  False
880        S  Second  woman       False  NaN  Southampton   yes  False
887        S   First  woman       False    B  Southampton   yes   True
889        C   First    man        True    C    Cherbourg   yes   True

[342 rows x 16 columns]

In [15]:
print('给列赋值')
print('给某一列赋值\n', data_select['embarked'] == np.array([0]*len(data_select)))

给列赋值
给某一列赋值
 0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: embarked, Length: 874, dtype: bool

In [16]:
data_select

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
####################分界线#######################

In [18]:
##############NOW WE DEVIDE THE DATASET TO THREE PARTS#####################

In [19]:
print('the first part conclude survived pclass sex age sibsp\n')
data_p1 = data.iloc[:, 0:6]
print('data_p1\n', data_p1)

print('the second part conclude parch fare embarcked class who\n')
data_p2 = data.iloc[:, 6:11]
print('data_p2\n', data_p2)

print('the third part conlude adult_male deck embarck_town alive alone\n')
data_p3 = data.iloc[:, 11:]
print('data_p3\n', data_p3)

the first part conclude survived pclass sex age sibsp

data_p1
      Unnamed: 0  survived  pclass     sex   age  sibsp
0             0         0       3    male  22.0      1
1             1         1       1  female  38.0      1
2             2         1       3  female  26.0      0
3             3         1       1  female  35.0      1
4             4         0       3    male  35.0      0
..          ...       ...     ...     ...   ...    ...
886         886         0       2    male  27.0      0
887         887         1       1  female  19.0      0
888         888         0       3  female   NaN      1
889         889         1       1    male  26.0      0
890         890         0       3    male  32.0      0

[891 rows x 6 columns]
the second part conclude parch fare embarcked class who

data_p2
      parch     fare embarked   class    who
0        0   7.2500        S   Third    man
1        0  71.2833        C   First  woman
2        0   7.9250        S   Third  woman
3        0  53.1000        S   First  woman
4        0   8.0500        S   Third    man
..     ...      ...      ...     ...    ...
886      0  13.0000        S  Second    man
887      0  30.0000        S   First  woman
888      2  23.4500        S   Third  woman
889      0  30.0000        C   First    man
890      0   7.7500        Q   Third    man

[891 rows x 5 columns]
the third part conlude adult_male deck embarck_town alive alone

data_p3
      adult_male deck  embark_town alive  alone
0          True  NaN  Southampton    no  False
1         False    C    Cherbourg   yes  False
2         False  NaN  Southampton   yes   True
3         False    C  Southampton   yes  False
4          True  NaN  Southampton    no   True
..          ...  ...          ...   ...    ...
886        True  NaN  Southampton    no   True
887       False    B  Southampton   yes   True
888       False  NaN  Southampton    no  False
889        True    C    Cherbourg   yes   True
890        True  NaN   Queenstown    no   True

[891 rows x 5 columns]

In [20]:
################如果列数和列名都是一致的就可以使用conact进行合并##############
data_conact_1 = pd.concat([data[:], data_select[:]], axis=0)
print('合并两个\n', data_conact_1)
data_conact_1.reset_index()

合并两个
      Unnamed: 0  survived  pclass     sex   age  sibsp  parch     fare  \
0             0         0       3    male  22.0      1      0   7.2500
1             1         1       1  female  38.0      1      0  71.2833
2             2         1       3  female  26.0      0      0   7.9250
3             3         1       1  female  35.0      1      0  53.1000
4             4         0       3    male  35.0      0      0   8.0500
..          ...       ...     ...     ...   ...    ...    ...      ...
886         886         0       2    male  27.0      0      0  13.0000
887         887         1       1  female  19.0      0      0  30.0000
888         888         0       3  female   NaN      1      2  23.4500
889         889         1       1    male  26.0      0      0  30.0000
890         890         0       3    male  32.0      0      0   7.7500

    embarked   class    who  adult_male deck  embark_town alive  alone
0          S   Third    man        True  NaN  Southampton    no  False
1          C   First  woman       False    C    Cherbourg   yes  False
2          S   Third  woman       False  NaN  Southampton   yes   True
3          S   First  woman       False    C  Southampton   yes  False
4          S   Third    man        True  NaN  Southampton    no   True
..       ...     ...    ...         ...  ...          ...   ...    ...
886        S  Second    man        True  NaN  Southampton    no   True
887        S   First  woman       False    B  Southampton   yes   True
888        S   Third  woman       False  NaN  Southampton    no  False
889        C   First    man        True    C    Cherbourg   yes   True
890        Q   Third    man        True  NaN   Queenstown    no   True

[1765 rows x 16 columns]

,index,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1760,886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
1761,887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
1762,888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
1763,889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
1764,890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [21]:
#############按行合并##############
data_concat_2 = pd.concat([data, data_select], axis=1)
print('按照行来合并\n', data_concat_2)

按照行来合并
      Unnamed: 0  survived  pclass     sex   age  sibsp parch     fare  \
0             0         0       3    male  22.0      1     0   7.2500
1             1         1       1  female  38.0      1     0  71.2833
2             2         1       3  female  26.0      0     0   7.9250
3             3         1       1  female  35.0      1     0  53.1000
4             4         0       3    male  35.0      0     0   8.0500
..          ...       ...     ...     ...   ...    ...   ...      ...
886         886         0       2    male  27.0      0     0  13.0000
887         887         1       1  female  19.0      0     0  30.0000
888         888         0       3  female   NaN      1     2  23.4500
889         889         1       1    male  26.0      0     0  30.0000
890         890         0       3    male  32.0      0     0   7.7500

    embarked   class  ... parch     fare embarked   class    who  adult_male  \
0          S   Third  ...   0.0   7.2500        S   Third    man        True
1          C   First  ...   0.0  71.2833        C   First  woman       False
2          S   Third  ...   0.0   7.9250        S   Third  woman       False
3          S   First  ...   0.0  53.1000        S   First  woman       False
4          S   Third  ...   0.0   8.0500        S   Third    man        True
..       ...     ...  ...   ...      ...      ...     ...    ...         ...
886        S  Second  ...   0.0  13.0000        S  Second    man        True
887        S   First  ...   0.0  30.0000        S   First  woman       False
888        S   Third  ...   2.0  23.4500        S   Third  woman       False
889        C   First  ...   0.0  30.0000        C   First    man        True
890        Q   Third  ...   0.0   7.7500        Q   Third    man        True

     deck  embark_town  alive  alone
0     NaN  Southampton     no  False
1       C    Cherbourg    yes  False
2     NaN  Southampton    yes   True
3       C  Southampton    yes  False
4     NaN  Southampton     no   True
..    ...          ...    ...    ...
886   NaN  Southampton     no   True
887     B  Southampton    yes   True
888   NaN  Southampton     no  False
889     C    Cherbourg    yes   True
890   NaN   Queenstown     no   True

[891 rows x 32 columns]

In [22]:
data_merge = data_conact_1.merge(data_1, on=['age'], how='inner')
data_merge

,Unnamed: 0_x,survived_x,pclass_x,sex_x,age,sibsp_x,parch_x,fare_x,embarked_x,class_x,...,parch_y,fare_y,embarked_y,class_y,who_y,adult_male_y,deck_y,embark_town_y,alive_y,alone_y
0,0,0,3,male,22.00,1,0,7.2500,S,Third,...,0,7.2500,S,Third,man,True,0,Southampton,no,False
1,0,0,3,male,22.00,1,0,7.2500,S,Third,...,0,7.2292,C,Third,man,True,0,Cherbourg,no,True
2,0,0,3,male,22.00,1,0,7.2500,S,Third,...,0,9.0000,S,Third,man,True,0,Southampton,no,True
3,0,0,3,male,22.00,1,0,7.2500,S,Third,...,0,8.0500,S,Third,man,True,0,Southampton,no,True
4,0,0,3,male,22.00,1,0,7.2500,S,Third,...,0,7.7500,S,Third,woman,False,0,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
22235,803,1,3,male,0.42,0,1,8.5167,C,Third,...,1,8.5167,C,Third,child,False,0,Cherbourg,yes,False
22236,843,0,3,male,34.50,0,0,6.4375,C,Third,...,0,6.4375,C,Third,man,True,0,Cherbourg,no,True
22237,843,0,3,male,34.50,0,0,6.4375,C,Third,...,0,6.4375,C,Third,man,True,0,Cherbourg,no,True
22238,851,0,3,male,74.00,0,0,7.7750,S,Third,...,0,7.7750,S,Third,man,True,0,Southampton,no,True
22239,851,0,3,male,74.00,0,0,7.7750,S,Third,...,0,7.7750,S,Third,man,True,0,Southampton,no,True

In [23]:
################group by #########################

In [27]:
grouped_1 = data_p1.groupby('sex').agg('mean')
grouped_1

        Unnamed: 0  survived    pclass        age     sibsp
sex
female  430.028662  0.742038  2.159236  27.915709  0.694268
male    453.147314  0.188908  2.389948  30.726645  0.429809

In [31]:
def get_avg_age(x):
    df = x.sort_values(by='age', ascending=True)
    return df.iloc[-1, :]

old_one = data.groupby('pclass', as_index=False).apply(get_avg_age)
old_one

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,849,1,1,female,NaN,1,0,89.1042,C,First,woman,False,C,Cherbourg,yes,False
1,732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
2,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False